NDJSec/FALCON/knowledge_base/svd/data/Freescale/MKV58F24.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMAMUX</name>
      <description>DMA channel multiplexor</description>
      <prependToName>DMAMUX_</prependToName>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>32</dim>
          <dimIncrement>0x1</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
          <name>CHCFG%s</name>
          <description>Channel Configuration register</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SOURCE</name>
              <description>DMA Channel Source (Slot)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable_Signal</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>UART0_Rx_Signal</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>UART0_Tx_Signal</description>
                  <value>#11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>UART1_Rx_Signal</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>UART1_Tx_Signal</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>PWM0_WR0_Signal</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>PWM0_WR1_Signal</description>
                  <value>#111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>PWM0_WR2_Signal</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>PWM0_WR3_Signal</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>PWM0_CP0_Signal</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>PWM0_CP1_Signal</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>PWM0_CP2_Signal</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>PWM0_CP3_Signal</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>CAN0_Signal</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>CAN1_Signal</description>
                  <value>#1111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>SPI0_Rx_Signal</description>
                  <value>#10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17</name>
                  <description>SPI0_Tx_Signal</description>
                  <value>#10001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>XBARA_OUT_0_Signal</description>
                  <value>#10010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19</name>
                  <description>XBARA_OUT_1_Signal</description>
                  <value>#10011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>XBARA_OUT_2_Signal</description>
                  <value>#10100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21</name>
                  <description>XBARA_OUT_3_Signal</description>
                  <value>#10101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22</name>
                  <description>I2C0_Signal</description>
                  <value>#10110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>FTM0_Channel0_Signal</description>
                  <value>#11000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>25</name>
                  <description>FTM0_Channel1_Signal</description>
                  <value>#11001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>26</name>
                  <description>FTM0_Channel2_Signal</description>
                  <value>#11010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>27</name>
                  <description>FTM0_Channel3_Signal</description>
                  <value>#11011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>28</name>
                  <description>FTM0_Channel4_Signal</description>
                  <value>#11100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>29</name>
                  <description>FTM0_Channel5_Signal</description>
                  <value>#11101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>30</name>
                  <description>FTM0_Channel6_Signal</description>
                  <value>#11110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>31</name>
                  <description>FTM0_Channel7_Signal</description>
                  <value>#11111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>FTM1_Channel0_Signal</description>
                  <value>#100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>33</name>
                  <description>FTM1_Channel1_Signal</description>
                  <value>#100001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>34</name>
                  <description>CMP3_Signal</description>
                  <value>#100010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>36</name>
                  <description>FTM3_Channel0_Signal</description>
                  <value>#100100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>37</name>
                  <description>FTM3_Channel1_Signal</description>
                  <value>#100101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>38</name>
                  <description>FTM3_Channel2_Signal</description>
                  <value>#100110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>39</name>
                  <description>FTM3_Channel3_Signal</description>
                  <value>#100111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>40</name>
                  <description>HSADC0A_Signal</description>
                  <value>#101000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>41</name>
                  <description>HSADC0B_Signal</description>
                  <value>#101001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>42</name>
                  <description>CMP0_Signal</description>
                  <value>#101010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>43</name>
                  <description>CMP1_Signal</description>
                  <value>#101011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>44</name>
                  <description>CMP2_Signal</description>
                  <value>#101100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>45</name>
                  <description>DAC0_Signal</description>
                  <value>#101101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>47</name>
                  <description>PDB1_Signal</description>
                  <value>#101111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>48</name>
                  <description>PDB0_Signal</description>
                  <value>#110000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>49</name>
                  <description>PortA_Signal</description>
                  <value>#110001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>50</name>
                  <description>PortB_Signal</description>
                  <value>#110010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>51</name>
                  <description>PortC_Signal</description>
                  <value>#110011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>52</name>
                  <description>PortD_Signal</description>
                  <value>#110100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>53</name>
                  <description>PortE_Signal</description>
                  <value>#110101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>54</name>
                  <description>FTM3_Channel4_Signal</description>
                  <value>#110110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>55</name>
                  <description>FTM3_Channel5_Signal</description>
                  <value>#110111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>56</name>
                  <description>FTM3_Channel6_Signal</description>
                  <value>#111000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>57</name>
                  <description>FTM3_Channel7_Signal</description>
                  <value>#111001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>60</name>
                  <description>AlwaysOn60_Signal</description>
                  <value>#111100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>61</name>
                  <description>AlwaysOn61_Signal</description>
                  <value>#111101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>62</name>
                  <description>AlwaysOn62_Signal</description>
                  <value>#111110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>63</name>
                  <description>AlwaysOn63_Signal</description>
                  <value>#111111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG</name>
              <description>DMA Channel Trigger Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Triggering is disabled. If triggering is disabled and ENBL is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Triggering is enabled. If triggering is enabled and ENBL is set, the DMAMUX is in Periodic Trigger mode.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENBL</name>
              <description>DMA Channel Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>DMA channel is disabled. This mode is primarily used during configuration of the DMAMux. The DMA has separate channel enables/disables, which should be used to disable or reconfigure a DMA channel.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>DMA channel is enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
