NDJSec/FALCON/knowledge_base/svd/data/Freescale/MKV58F24.svd
                </enumeratedValue>
                <enumeratedValue>
                  <name>26</name>
                  <description>PWMA channel 3 trigger 0</description>
                  <value>#11010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>27</name>
                  <description>PWMA channel 3 trigger 1</description>
                  <value>#11011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>28</name>
                  <description>PDB0 channel 1 output trigger</description>
                  <value>#11100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>29</name>
                  <description>PDB0 channel 0 output trigger</description>
                  <value>#11101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>30</name>
                  <description>PDB1 channel 1 output trigger</description>
                  <value>#11110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>31</name>
                  <description>PDB1 channel 0 output trigger</description>
                  <value>#11111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>High Speed Analog-to-Digital Converter 1 conversion A complete</description>
                  <value>#100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>33</name>
                  <description>High Speed Analog-to-Digital Converter 0 conversion A complete</description>
                  <value>#100001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>34</name>
                  <description>High Speed Analog-to-Digital Converter 1 conversion B complete</description>
                  <value>#100010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>35</name>
                  <description>High Speed Analog-to-Digital Converter 0 conversion B complete</description>
                  <value>#100011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>36</name>
                  <description>FTM1 all channels output compare ORed together</description>
                  <value>#100100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>37</name>
                  <description>FTM1 all channels counter init ORed together</description>
                  <value>#100101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>38</name>
                  <description>DMA channel 0 done</description>
                  <value>#100110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>39</name>
                  <description>DMA channel 1 done</description>
                  <value>#100111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>40</name>
                  <description>DMA channel 6 done</description>
                  <value>#101000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>41</name>
                  <description>DMA channel 7 done</description>
                  <value>#101001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>42</name>
                  <description>PIT trigger 0</description>
                  <value>#101010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>43</name>
                  <description>PIT trigger 1</description>
                  <value>#101011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>44</name>
                  <description>Analog-to-Digital Converter 0 conversion complete</description>
                  <value>#101100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>45</name>
                  <description>ENC compare trigger and position match</description>
                  <value>#101101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>46</name>
                  <description>AOI output 0</description>
                  <value>#101110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>47</name>
                  <description>AOI output 1</description>
                  <value>#101111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>48</name>
                  <description>AOI output 2</description>
                  <value>#110000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>49</name>
                  <description>AOI output 3</description>
                  <value>#110001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>50</name>
                  <description>PIT trigger 2</description>
                  <value>#110010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>51</name>
                  <description>PIT trigger 3</description>
                  <value>#110011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>52</name>
                  <description>PWMB channel 0 trigger 0 or trigger 1</description>
                  <value>#110100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>53</name>
                  <description>PWMB channel 1 trigger 0 or trigger 1</description>
                  <value>#110101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>54</name>
                  <description>PWMB channel 2 trigger 0 or trigger 1</description>
                  <value>#110110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>55</name>
                  <description>PWMB channel 3 trigger 0 or trigger 1</description>
                  <value>#110111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>56</name>
                  <description>FTM2 all channels output compare ORed together</description>
                  <value>#111000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>57</name>
                  <description>FTM2 all channels counter init ORed together</description>
                  <value>#111001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
