NDJSec/FALCON/knowledge_base/svd/data/Freescale/MKV58F24.svd
        <register>
          <name>ID_ISAR0</name>
          <description>Instruction Set Attributes Register 0</description>
          <addressOffset>0xD60</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BITCOUNT_INSTRS</name>
              <description>Indicates the supported Bit Counting instructions</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>None supported, ARMv7-M reserved</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Adds support for the CLZ instruction</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BITFIELD_INSTRS</name>
              <description>Indicates the supported BitField instructions</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>None supported, ARMv7-M reserved</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Adds support for the BFC, BFI, SBFX, and UBFX instructions</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMPBRANCH_INSTRS</name>
              <description>Indicates the supported combined Compare and Branch instructions</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>None supported, ARMv7-M reserved</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Adds support for the CBNZ and CBZ instructions</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COPROC_INSTRS</name>
              <description>Indicates the supported Coprocessor instructions</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>None supported, except for separately attributed architectures, for example the Floating-point extension</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>Adds support for generic CDP, LDC, MCR, MRC, and STC instructions</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>As for 1, and adds support for generic CDP2, LDC2, MCR2, MRC2, and STC2 instructions</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>As for 2, and adds support for generic MCRR and MRRC instructions</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>As for 3, and adds support for generic MCRR2 and MRRC2 instructions</description>
                  <value>#0100</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEBUG_INSTRS</name>
              <description>Indicates the supported Debug instructions</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>None supported, ARMv7-M reserved</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Adds support for the BKPT instruction</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVIDE_INSTRS</name>
              <description>Indicates the supported Divide instructions</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>None supported, ARMv7-M reserved</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Adds support for the SDIV and UDIV instructions</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_ISAR1</name>
          <description>Instruction Set Attributes Register 1</description>
          <addressOffset>0xD64</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTEND_INSTRS</name>
              <description>Indicates the supported Extend instructions</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>None supported, ARMv7-M reserved</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Adds support for the SXTB, SXTH, UXTB, and UXTH instructions</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>As for 1, and adds support for the SXTAB, SXTAB16, SXTAH, SXTB16, UXTAB, UXTAB16, UXTAH, and UXTB16 instructions</description>
                  <value>#0010</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFTHEN_INSTRS</name>
              <description>Indicates the supported IfThen instructions</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>None supported, ARMv7-M reserved</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Adds support for the IT instructions, and for the IT bits in the PSRs</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IMMEDIATE_INSTRS</name>
              <description>Indicates the support for data-processing instructions with long immediate</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>None supported, ARMv7-M reserved</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Adds support for the ADDW, MOVW, MOVT, and SUBW instructions</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTERWORK_INSTRS</name>
              <description>Indicates the supported Interworking instructions</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>None supported, ARMv7-M reserved</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Adds support for the BX instruction, and the T bit in the PSR</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>As for 1, and adds support for the BLX instruction, and PC loads have BX-like behavior</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>ARMv7-M reserved</description>
                  <value>#0011</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_ISAR2</name>
          <description>Instruction Set Attributes Register 2</description>
          <addressOffset>0xD68</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOADSTORE_INSTRS</name>
              <description>Indicates the supported additional load and store instructions</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>None supported, ARMv7-M reserved</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Adds support for the LDRD and STRD instructions</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEMHINT_INSTRS</name>
              <description>Indicates the supported Memory Hint instructions</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>None supported, ARMv7-M reserved.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Adds support for the PLD instruction, ARMv7-M reserved.</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>As for 1, ARMv7-M reserved.</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>As for 1 or 2, and adds support for the PLI instruction.</description>
                  <value>#0011</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULTIACCESSINT_INSTRS</name>
              <description>Indicates the support for multi-access interruptible instructions</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>None supported. This means the LDM and STM instructions are not interruptible. ARMv7-M reserved.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>LDM and STM instructions are restartable.</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>LDM and STM instructions are continuable.</description>
                  <value>#0010</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULT_INSTRS</name>
              <description>Indicates the supported additional Multiply instructions</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>None supported. This means only MUL is supported. ARMv7-M reserved.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Adds support for the MLA instruction, ARMv7-M reserved.</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>As for 1, and adds support for the MLS instruction.</description>
                  <value>#0010</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULTS_INSTRS</name>
              <description>Indicates the supported advanced signed Multiply instructions</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>None supported, ARMv7-M reserved</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Adds support for the SMULL and SMLAL instructions</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>As for 1, and adds support for the SMLABB, SMLABT, SMLALBB, SMLALBT, SMLALTB, SMLALTT, SMLATB, SMLATT, SMLAWB, SMLAWT, SMULBB, SMULBT, SMULTB, SMULTT, SMULWB, and SMULWT instructions.</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>As for 2, and adds support for the SMLAD, SMLADX, SMLALD, SMLALDX, SMLSD, SMLSDX, SMLSLD, SMLSLDX, SMMLA, SMMLAR, SMMLS, SMMLSR, SMMUL, SMMULR, SMUAD, SMUADX, SMUSD, and SMUSDX instructions.</description>
                  <value>#0011</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULTU_INSTRS</name>
              <description>Indicates the supported advanced unsigned Multiply instructions</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>None supported, ARMv7-M reserved</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Adds support for the UMULL and UMLAL instructions.</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>As for 1, and adds support for the UMAAL instruction.</description>
                  <value>#0010</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REVERSAL_INSTRS</name>
              <description>Indicates the supported Reversal instructions</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>None supported, ARMv7-M reserved</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Adds support for the REV, REV16, and REVSH instructions, ARMv7-M reserved.</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>As for 1, and adds support for the RBIT instruction.</description>
                  <value>#0010</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
