NDJSec/FALCON/knowledge_base/svd/data/Freescale/MKV58F24.svd
        <register>
          <name>CM7_DTCMCR</name>
          <description>Data Tightly-Coupled Memory Control Register</description>
          <addressOffset>0xF94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>TCM enable. When a TCM is disabled all accesses are made to the AXIM interface.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>TCM disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>TCM enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RMW</name>
              <description>Read-Modify-Write (RMW) enable. Indicates that all writes to TCM, that are not the full width of the TCM RAM, use a RMW sequence.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>RMW disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>RMW enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RETEN</name>
              <description>Retry phase enable. When enabled the processor guarantees to honor the retry output on the corresponding TCM interface, re-executing the instruction which carried out the TCM access.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Retry phase disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Retry phase enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SZ</name>
              <description>TCM size. Indicates the size of the relevant TCM.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No TCM implemented.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>4KB.</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>8KB.</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>16KB.</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>32KB.</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>64KB.</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>128KB.</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>256KB.</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>512KB.</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>1MB.</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>2MB.</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>4MB.</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>8MB.</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>16MB.</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CM7_AHBPCR</name>
          <description>AHBP Control Register</description>
          <addressOffset>0xF98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>AHBP enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>AHBP disabled. When disabled all accesses are made to the AXIM interface.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>AHBP enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SZ</name>
              <description>AHBP size.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>0MB. AHBP disabled.</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>64MB.</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>128MB.</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>256MB.</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>512MB.</description>
                  <value>#100</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CM7_CACR</name>
          <description>L1 Cache Control Register</description>
          <addressOffset>0xF9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SIWT</name>
              <description>Shared cacheable-is-WT for data cache. Enables limited cache coherency usage.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal Cacheable Shared locations are treated as being Non-cacheable. Default mode of operation for Shared memory.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Normal Cacheable shared locations are treated as Write-Through.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECCDIS</name>
              <description>Enables ECC in the instruction and data cache.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Enables ECC in the instruction and data cache.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Disables ECC in the instruction and data cache.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEWT</name>
              <description>Enables Force Write-Through in the data cache.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables Force Write-Through.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables Force Write-Through. All Cacheable memory regions are treated as Write-Through.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CM7_AHBSCR</name>
          <description>AHB Slave Control Register</description>
          <addressOffset>0xFA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTL</name>
              <description>AHBS prioritization control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>AHBS access priority demoted. This is the reset value.</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Software access priority demoted.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>AHBS access priority demoted by initializing the fairness counter to the CM7_AHBSCR[INITCOUNT] value when the software execution priority is higher than or equal to the threshold level programed in CM7_AHBSCR[TPRI].</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>AHBSPRI signal has control of access priority.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPRI</name>
              <description>Threshold execution priority for AHBS traffic demotion.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INITCOUNT</name>
              <description>Fairness counter initialization value.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM7_ABFSR</name>
          <description>Auxiliary Bus Fault Status Register</description>
          <addressOffset>0xFA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ITCM</name>
              <description>Asynchronous fault on ITCM interface.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTCM</name>
              <description>Asynchronous fault on DTCM interface.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBP</name>
              <description>Asynchronous fault on AHBP interface.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXIM</name>
              <description>Asynchronous fault on AXIM interface.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPPB</name>
              <description>Asynchronous fault on EPPB interface.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXIMTYPE</name>
              <description>Indicates the type of fault on the AXIM interface. Only valid when AXIM is 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>OKAY.</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>EXOKAY.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>SLVERR.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>DECERR.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
